In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('./Churn_Modelling.csv')

In [4]:
df.columns

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

In [7]:
users = df[['CustomerId', 'Surname','Geography',
       'Gender', 'Age','EstimatedSalary']]
users.head(3)

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary
0    15634602  Hargrave    France  Female   42        101348.88
1    15647311      Hill     Spain  Female   41        112542.58
2    15619304      Onio    France  Female   42        113931.57

In [6]:
bank = df[['CustomerId', 'CreditScore','Tenure',
       'Balance', 'NumOfProducts','HasCrCard','IsActiveMember','Exited']]
bank.head(3)

,CustomerId,CreditScore,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,Exited
0,15634602,619,2,0.00,1,1,1,1
1,15647311,608,1,83807.86,1,0,1,0
2,15619304,502,8,159660.80,3,1,0,1

In [15]:
users.to_csv('users.csv', index=False, sep=';', encoding='utf-8')

In [16]:
bank.to_csv('bank.csv', index=False, sep=',', encoding='utf-8')

In [18]:
users = pd.read_csv('users.csv', sep=';')
users.head()

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary
0    15634602  Hargrave    France  Female   42        101348.88
1    15647311      Hill     Spain  Female   41        112542.58
2    15619304      Onio    France  Female   42        113931.57
3    15701354      Boni    France  Female   39         93826.63
4    15737888  Mitchell     Spain  Female   43         79084.10

In [19]:
users.shape

(10000, 6)

### Создание новых признаков

In [20]:
users['new_feature'] = 0
users.head()

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary  new_feature
0    15634602  Hargrave    France  Female   42        101348.88            0
1    15647311      Hill     Spain  Female   41        112542.58            0
2    15619304      Onio    France  Female   42        113931.57            0
3    15701354      Boni    France  Female   39         93826.63            0
4    15737888  Mitchell     Spain  Female   43         79084.10            0

In [21]:
users['Age (days)'] = users['Age'] * 365
users.head()

,CustomerId,Surname,Geography,Gender,Age,EstimatedSalary,new_feature,Age (days)
0,15634602,Hargrave,France,Female,42,101348.88,0,15330
1,15647311,Hill,Spain,Female,41,112542.58,0,14965
2,15619304,Onio,France,Female,42,113931.57,0,15330
3,15701354,Boni,France,Female,39,93826.63,0,14235
4,15737888,Mitchell,Spain,Female,43,79084.10,0,15695

In [22]:
for i, row in users.iloc[:2].iterrows():
    print(row)
    print('__' * 30)

CustomerId          15634602
Surname             Hargrave
Geography             France
Gender                Female
Age                       42
EstimatedSalary    101348.88
new_feature                0
Age (days)             15330
Name: 0, dtype: object
____________________________________________________________
CustomerId          15647311
Surname                 Hill
Geography              Spain
Gender                Female
Age                       41
EstimatedSalary    112542.58
new_feature                0
Age (days)             14965
Name: 1, dtype: object
____________________________________________________________